#!/usr/bin/env python
# -*- coding: utf-8 -*-

"""
-------------------------------------------------
   File Name:          替换
   Description:
   Author:             Black Hole
   date:               2020/12/14
-------------------------------------------------
   Change Activity:    2020/12/14:
-------------------------------------------------
"""

__author__ = "Black Hole"

import re

# 指定声明过滤
statement = "声明：转载此文是出于传递更多信息之目的。若有来源标注错误或侵犯了您的合法权益，请作者持权属证明与本网联系，我们将及时更正、删除，谢谢。"
text = """#辛巴回应燕窝事件# 【辛巴退赔6198万元!】11月27日下午6时，辛巴（实名辛有志）发表声明承认带货的燕窝产品实为一款燕窝风味饮品，确实存在夸大销售。他称品牌方一直避而不见，其决定先行赔付，承担“退一赔三”6198万元。

声明：转载此文是出于传递更多信息之目的。若有来源标注错误或侵犯了您的合法权益，请作者持权属证明与本网联系，我们将及时更正、删除，谢谢。"""
text = re.sub(statement, "", text)
print(text)
