#!/usr/bin/env python
# -*- coding: utf-8 -*-

"""
-------------------------------------------------
   File Name:   繁体与简体互转
   Description:
   Author:      Black Hole
   date:        2020/5/26
-------------------------------------------------
   Change Activity:
                2020/5/26:
-------------------------------------------------
"""

__author__ = 'Black Hole'

from opencc import OpenCC

s1 = """罗志祥|肖战|王俊凯|全昭妍|金珉锡|魏晨|张艺兴|孟美岐|李钟硕|周震南|华晨宇|李现|邓伦|杨紫|蔡徐坤|杨超越|金宣虎|杨幂|大张伟|郭麒麟|
黄明昊|杨洋|毛不易|李汶翰|金有谦|张紫宁|黄景瑜|任敏|曾舜晞|王凯|佟丽娅|张铭恩|江疏影|张杰|梁世宗|郭俊辰|黄子韬|鹿晗|关晓彤|欧阳娜娜|陈伟霆|
郑允浩|李宇春|李易峰|吴磊|朱一龙|郑恺|张嘉倪|俞灏明|王栎鑫|王一博|汪涵|Lisa|滕华涛|赵今麦|虞书欣|刘雨昕|赵小棠|李沁|周杰伦|昆凌|鞠婧祎|刘昊然|
宋茜|何炅|宁静|戚薇|蔡少芬|吴亦凡|任嘉伦|马伊琍|刘天佐|王祖蓝|谭松韵|王嘉尔|于朦胧|迪丽热巴|高伟光|陈学冬|周笔畅|魏大勋|张一山|邓紫棋|李敏镐|
张子枫|彭昱畅|吴谨言|易烊千玺|王源|孙菲菲|范冰冰|范丞丞|郭京飞|李小璐|贾乃亮|郑爽|闽清子|纪凌尘|杨颖|黄晓明"""

s2 = """射手座|水瓶座|水瓶男|水瓶女|巨蟹座|天秤座|天蝎座|白羊座|金牛座|双子座|双鱼座|狮子座|处女座|双子月|星座合盘|星盘|摩羯座|星座运势|
星座特质|上升星座|太阳星座|幸运色|开运物|塔罗周运|金星|海王星|水星|恋爱宫|上升白羊座|上升巨蟹座|上升天秤座|上升摩羯座|上升金牛座|上升狮子座|
上升天蝎座|上升水瓶座|上升双子座|上升处女座|上升射手座|上升双鱼座|星象播报|水逆|星象|桃花运|新月|财运|占星|金星逆行|北斗七星|星官|冥王|占星术|
先天宫位|黄道经度区|后天宫位区|星体|星座|宫位|相位|实星|虚星|子星|酉星|午星|先天十二宫|后天十二宫|后宫位|天王星|太阳|月亮|木星|火星|土星|冥王星
|满月|命理|星座命理|巨蟹月|天秤月|天蝎月|白羊月|金牛月|双鱼月|狮子月|处女月|摩羯月|射手月|水瓶月|巨蟹女|天秤女|天蝎女|白羊女|金牛女|双鱼女|
狮子女|摩羯女|射手女|巨蟹男|12星座|十二星座"""

s3 = """气象台|降雨|雷雨|强降雨|强对流|雷电|晴|多云|阴|多雨|龙舟水|降雨量|冷涡|气温|最高气温|最低气温|冷空气|炎热|昼夜温差|气温变化|
晴到多云|晴转多云|北转东风|东转南风|南转北风|偏北风|北转南风|阴转雷阵雨|阴转晴|晴间多云|多云转阴|强降水|雷暴大风|对流天气|暴雨|多阵雨|雷阵雨|
雨量大|降雨多|大暴雨|气温多起伏|降雨频繁|短暂降温|大到暴雨|局地大暴雨|防雷避雨|分散阵雨|雷雨云团|强雷雨|阵风|阴天间多云|阴云密布|多云到阴天|
今夜多云|明天晴|今天多云|北风3级|多云转晴|阴转多云|小雨转阴|多云转小雨|北风4级|小雨转多云|今天晴|今夜晴|雷阵雨转中雨|雷阵雨转阴|中雨|
小雨转中到大雨|中雨转多云|偏南风|局地伴有扬沙|高温天气|气温实况|气温升高|雨量增多|晴天到多云|多云到晴天|阴天有阵雨|降温幅度|短临预报|局地|
晴天间多云|午间预报|早间预报|晚间预报|多云转晴天|阴天转多云|局部小雨|大风天气|三天预报|七天预报|十五天预报|气象资料|气象报道|预报信息|天气预报|
阴天转小雨|零星小雨|天气实况"""

s4 = """NBA|CBA|足球|英超|羽毛球|棒球|篮球|手球|曲棍球|垒球|乒乓球|网球|排球|地掷球|藤球|门球|毽球|壁球|台球|高尔夫|保龄球|沙壶球|
橄榄球|击剑|滑冰|拳击|跳水|空手道|赛马|健美操|跆拳道|武术|柔道|田径|游泳|欧洲杯|法甲联赛|体操|举重|马拉松|世界杯|中超|西甲|德甲|意甲|欧冠|
射箭|射击|10米气步枪|马术|铁人三项|现代五项|帆船|水球|皮划艇|自行车|花样游泳|散打|花样滑冰|冰上舞蹈|冰球|速度滑冰|越野赛|PBA联赛|国足|五大联赛
|亚冠|足协杯|女足|赛车|棋牌|F1|围棋|象棋|3X3|5X5|NFL|钓鱼|奥运|ESPN|UCL|LPL|KPL|MLB|UTMB|仰泳|蝶泳|蛙泳|捷泳|摔角|女排|男排|女篮|攀岩|
跨栏|冲浪|平地赛马|障碍赛马|越野赛马|飞镖"""

s5 = """炫迈|康师傅茉莉清茶|spa7ce|韩国艺匠ArtizStudio|香奈儿|康师傅冰红茶|康师傅|荣耀X10|荣耀|安慕希|特仑苏|金典|奇瑞汽车|瑞虎8|
护舒宝|皮秒祛斑|现代汽车|Veloster N|脱发|植发|洁丽雅|SANKO|Lactasoy力大狮|QQ星|整形|富士拍立得|富士康拍立得|三只松鼠|优惠券|穗华口腔|
德伦口腔|广大口腔|雅度口腔|整形项目价格表|祛疤|壹加壹口腔|咕咕熊|PUMA|彪马|PUMA X LIU WEN联名系列|饭糕漫画|饭糕学院|雅萌YA-MAN|
雅萌Professional系列|淘宝优惠券|折扣券|美牙齿矫|牙齿矫正|美宝莲|雅萌ACE射频仪|雅萌|rom&nd|romand|伊利QQ星|凯旋1664|歌瑞尔|好欢螺|
申请广州户口|广州入户|舒蕾|纯棉洗脸巾|平面设计自习室|killer|三星|圣罗兰|vivo|三星8K电视|魅族|小米|天猫精灵|隐形矫治|雪佛兰|凯迪拉克|奥迪|
宝马|奔驰|丰田|BMW|川崎|比亚迪|稚优泉|DIOR|保时捷|colorkey|Kawasaki|梅赛德斯-AMG|纪梵希|vivo X50|herbal essences|科颜氏|
louis vuitton|OLAY|欧莱雅|飞利浦|MAC|魅可|YSL|兰蔻|阿玛尼|迪奥"""

filter_str = [i.strip() for i in s1.split('|') + s2.split('|') + s3.split('|') + s4.split('|') + s5.split('|')]
# print(filter_str)

# 简体转繁体
ts = OpenCC('t2s')
print(ts.convert("罗志祥"))

# 繁体转简体
st = OpenCC('s2t')
print(st.convert("罗志祥"))
print(st.convert(s1))
